src/test/resources/full.demo.project.cli.tests/src/test/resources/WSwithDatabaseTest/a001WSPutMessage/HTTP.ADDBOOK/testinput.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:book="http://www.cleverbuilder.com/BookService/">
   <soapenv:Header/>
   <soapenv:Body>
      <book:AddBook>
         <Title>TestBook</Title>
         <Author>Test Author</Author>
      </book:AddBook>
   </soapenv:Body>
</soapenv:Envelope>